Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийGUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АутентификацияИАвторизация/Ext/Module.bsl
Процедура ВыполнитьРегистрацию(Логин, Телефон) Экспорт
	
	Соединение = Новый HTTPСоединение("192.168.1.104", , "Администратор", "");
	
	ПутьЗапроса = "Grooming/hs/users/register?username=" + Логин + "&phone=" + Телефон;
	Запрос = Новый HTTPЗапрос(ПутьЗапроса);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеССервера = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		
		АвторизоватьПользователя(ДанныеССервера, Телефон);
	КонецЕсли;
	
КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеССервера, Телефон) Экспорт
	
	НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользовательИБ.Имя = ДанныеССервера.name;
	НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
	НовыйПользовательИБ.Записать();
	
	ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
	ОбъектПользователь.Наименование = ДанныеССервера.name;
	ОбъектПользователь.ВнешнийGUID = ДанныеССервера.code; 
	ОбъектПользователь.Телефон     = Телефон; 
	ОбъектПользователь.Записать();
	
	ПараметрыСеанса.ТекущийПользователь = ОбъектПользователь.Ссылка;
	
КонецПроцедуры
